app/controllers/categories_controller.rb

SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 3 LIMIT 1
---
	def show
		@category = Category.find(params[:id])

SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 3 LIMIT 1
---
	def update
		@category = Category.find(params[:id])