app/views/categories/index.html.erb

SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 0  ORDER BY `categories`.`id` ASC LIMIT 1
---
				<td>
					<% if parent = Category.where(:id => item.parent_id).first %>